<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"d5c1af38275b29d6316dccf3dc41a74065c372c210f71a334e0856f485d4a8de","plan_job_ref":"Job Cloudflare Infra #3 at https://github.com/7w1/sable/actions/runs/22701713594","plan_out_hash":"0d64cf4ff81f5c40e4121c7ecc0e26472a089f7ef0152cc45cb3b44c26a486be","plan_hash":"2c1d2152edd6ca54faaf0bd0ea81631812312d7160e87287c98540e3711cb3cd","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 3 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "b7e9cf7fac6703fa0c0f5f5a4ffe0a0b2d057c6f5bd8e3452797c033cdb7f325" -> "24ca4754500d7d24b6b0f3e0f8286e5934b9da8dbdfd53703c56d5f0f3d782ee" # forces replacement
!~          directory             = "C:/Sable Matrix Client/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-05T03:52:43Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 2 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_custom_domain.site will be created
+   resource "cloudflare_workers_custom_domain" "site" {
+       account_id  = (sensitive value)
+       environment = "production"
+       hostname    = "app.sable.moe"
+       id          = (known after apply)
+       service     = "sable"
+       zone_id     = (sensitive value)
+       zone_name   = (known after apply)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
+           workers_message      = "Change trigger from dev branch to version tags"
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
!~      author_email = "cloudflare@sl.sable.moe" -> (known after apply)
!~      created_on   = "2026-03-05T03:52:45Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #3](https://github.com/7w1/sable/actions/runs/22701713594)